Catalogs/ТипыСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыСкидокНаценок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыОплатЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВытесняющаяСкидка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСобытий</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловияДополнительное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияСкидок</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРаспространяетсяНаДепозитнуюКарту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогДисконтнойПрограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПериодаДействияПриДобавленииБлюда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммоваяСкидкаНаценка</Name>
					<Comment>Скидка или наценка выражается суммой</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточняемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УсловияСкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>УсловияСкидкиНаценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидуДисконтныхКарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидуСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГруппеСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДисконтнойКарте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДисконтнойПрограмме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДнюРождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКатегорииДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКатегорииКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличествуТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМаршрутуДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСертификату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСуммеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУсловиюВидаДисконтнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнаяСкидка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыСкидокНаценок/Ext/ManagerModule.bsl
Функция ДоступностьУточняемости(ТипСкидкиНаценки) Экспорт

	Возврат ((ТипСкидкиНаценки.Условие = Перечисления.УсловияСкидкиНаценки.РучнаяСкидка) Или
			 (ТипСкидкиНаценки.Условие = Перечисления.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт) Или
			 (ТипСкидкиНаценки.Условие = Перечисления.УсловияСкидкиНаценки.ПоВидуСертификата) Или
			 (ТипСкидкиНаценки.Условие = Перечисления.УсловияСкидкиНаценки.ПоДисконтнойКарте) Или
			 (ТипСкидкиНаценки.Условие = Перечисления.УсловияСкидкиНаценки.ПоСертификату));

КонецФункции // ДоступностьУточняемости()

Функция ДоступностьВытесняющейСкидки(ТипСкидкиНаценки) Экспорт

	//Возврат Истина;
	
	//Костенюк Александр-Старт 16.08.2012
	Возврат НЕ ТипСкидкиНаценки.СуммоваяСкидкаНаценка;
	//Костенюк Александр-Финиш 16.08.2012

КонецФункции // ДоступностьВытесняющейСкидки()


Функция ОипсаниеТипаЗначенияУсловия(ТипСкидкиНаценки) Экспорт

	Условие = ТипСкидкиНаценки.Условие;
	
	Если (Условие = Перечисления.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт) Или
		 (Условие = Перечисления.УсловияСкидкиНаценки.ПоДисконтнойПрограмме) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ВидыДисконтныхКарт");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоДисконтнойКарте) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ИнформационныеКарты");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоВидуСертификата) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ВидыСертификатов");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоСертификату) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Сертификаты");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоКатегорииДокумента) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.КатегорииДокументов");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоКатегорииКонтрагента) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.КатегорииКонтрагентов");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоГруппеСобытия) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ГруппыСобытий");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоДнюРождения) Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоСуммеДокумента) Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 2, ДопустимыйЗнак.Неотрицательный));
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоКоличествуТовара) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоМаршрутуДоставки) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.МаршрутыДоставки");
	//Костенюк Александр-Старт 21.09.2012
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоУсловиюВидаДисконтнойКарты) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ВидыДисконтныхКарт");
	//Костенюк Александр-Финиш 21.09.2012
	КонецЕсли;

	Возврат Новый ОписаниеТипов("Неопределено");
	
КонецФункции // ОипсаниеТипаЗначенияУсловия()

Функция ОипсаниеТипаЗначенияУсловияДополнительное(ТипСкидкиНаценки) Экспорт

	Условие = ТипСкидкиНаценки.Условие;
	
	Если (Условие = Перечисления.УсловияСкидкиНаценки.ПоДнюРождения) Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоКоличествуТовара) Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	//Костенюк Александр-Старт 21.09.2012
	ИначеЕсли (Условие = Перечисления.УсловияСкидкиНаценки.ПоУсловиюВидаДисконтнойКарты) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.УсловияСкидок");
	//Костенюк Александр-Финиш 21.09.2012
	КонецЕсли;

	Возврат Новый ОписаниеТипов("Неопределено");
	
КонецФункции // ОипсаниеТипаЗначенияУсловияДополнительное()
